# Power Outage Prediction

**Name(s)**: Serena Chen, Andy Guo

**Website Link**: (your website link)

In [56]:
import pandas as pd
import numpy as np

import plotly.express as px
pd.options.plotting.backend = 'plotly'

from lec_utils import * # Feel free to uncomment and use this. It'll make your plotly graphs look like ours in lecture!

## Step 1: Introduction

In [57]:
# TODO

## Step 2: Data Cleaning and Exploratory Data Analysis

In [58]:
outage  = pd.read_excel("outage.xlsx",header = 5)
outage

,variables,OBS,YEAR,MONTH,...,AREAPCT_UC,PCT_LAND,PCT_WATER_TOT,PCT_WATER_INLAND
0,Units,NaN,NaN,NaN,...,%,%,%,%
1,NaN,1.0,2011.0,7.0,...,0.6,91.59,8.41,5.48
2,NaN,2.0,2014.0,5.0,...,0.6,91.59,8.41,5.48
...,...,...,...,...,...,...,...,...,...
1532,NaN,1532.0,2009.0,8.0,...,0.15,98.31,1.69,1.69
1533,NaN,1533.0,2009.0,8.0,...,0.15,98.31,1.69,1.69
1534,NaN,1534.0,2000.0,NaN,...,0.02,85.76,14.24,2.9

In [59]:
outage['variables']

0       Units
1         NaN
2         NaN
        ...
1532      NaN
1533      NaN
1534      NaN
Name: variables, Length: 1535, dtype: object

## Step 3: Framing a Prediction Problem

In [60]:
list(outage.columns)

['variables',
 'OBS',
 'YEAR',
 'MONTH',
 'U.S._STATE',
 'POSTAL.CODE',
 'NERC.REGION',
 'CLIMATE.REGION',
 'ANOMALY.LEVEL',
 'CLIMATE.CATEGORY',
 'OUTAGE.START.DATE',
 'OUTAGE.START.TIME',
 'OUTAGE.RESTORATION.DATE',
 'OUTAGE.RESTORATION.TIME',
 'CAUSE.CATEGORY',
 'CAUSE.CATEGORY.DETAIL',
 'HURRICANE.NAMES',
 'OUTAGE.DURATION',
 'DEMAND.LOSS.MW',
 'CUSTOMERS.AFFECTED',
 'RES.PRICE',
 'COM.PRICE',
 'IND.PRICE',
 'TOTAL.PRICE',
 'RES.SALES',
 'COM.SALES',
 'IND.SALES',
 'TOTAL.SALES',
 'RES.PERCEN',
 'COM.PERCEN',
 'IND.PERCEN',
 'RES.CUSTOMERS',
 'COM.CUSTOMERS',
 'IND.CUSTOMERS',
 'TOTAL.CUSTOMERS',
 'RES.CUST.PCT',
 'COM.CUST.PCT',
 'IND.CUST.PCT',
 'PC.REALGSP.STATE',
 'PC.REALGSP.USA',
 'PC.REALGSP.REL',
 'PC.REALGSP.CHANGE',
 'UTIL.REALGSP',
 'TOTAL.REALGSP',
 'UTIL.CONTRI',
 'PI.UTIL.OFUSA',
 'POPULATION',
 'POPPCT_URBAN',
 'POPPCT_UC',
 'POPDEN_URBAN',
 'POPDEN_UC',
 'POPDEN_RURAL',
 'AREAPCT_URBAN',
 'AREAPCT_UC',
 'PCT_LAND',
 'PCT_WATER_TOT',
 'PCT_WATER_INLAND']

In [61]:
categorical_vars = [
    'OBS',
    'U.S._STATE',
    'POSTAL.CODE',
    'NERC.REGION',
    'CLIMATE.REGION',
    'ANOMALY.LEVEL',
    'CLIMATE.CATEGORY',
    'OUTAGE.START.DATE',
    'OUTAGE.START.TIME',
    'OUTAGE.RESTORATION.DATE',
    'OUTAGE.RESTORATION.TIME',
    'CAUSE.CATEGORY',
    'CAUSE.CATEGORY.DETAIL',
    'HURRICANE.NAMES'
]

# List of numerical variables
numerical_vars = [
    'YEAR',
    'MONTH',
    'OUTAGE.DURATION',
    'DEMAND.LOSS.MW',
    'CUSTOMERS.AFFECTED',
    'RES.PRICE',
    'COM.PRICE',
    'IND.PRICE',
    'TOTAL.PRICE',
    'RES.SALES',
    'COM.SALES',
    'IND.SALES',
    'TOTAL.SALES',
    'RES.PERCEN',
    'COM.PERCEN',
    'IND.PERCEN',
    'RES.CUSTOMERS',
    'COM.CUSTOMERS',
    'IND.CUSTOMERS',
    'TOTAL.CUSTOMERS',
    'RES.CUST.PCT',
    'COM.CUST.PCT',
    'IND.CUST.PCT',
    'PC.REALGSP.STATE',
    'PC.REALGSP.USA',
    'PC.REALGSP.REL',
    'PC.REALGSP.CHANGE',
    'UTIL.REALGSP',
    'TOTAL.REALGSP',
    'UTIL.CONTRI',
    'PI.UTIL.OFUSA',
    'POPULATION',
    'POPPCT_URBAN',
    'POPPCT_UC',
    'POPDEN_URBAN',
    'POPDEN_UC',
    'POPDEN_RURAL',
    'AREAPCT_URBAN',
    'AREAPCT_UC',
    'PCT_LAND',
    'PCT_WATER_TOT',
    'PCT_WATER_INLAND'
]

## Step 4: Baseline Model

## Step 5: Final Model

In [62]:
outage = outage.drop(columns='variables', errors='ignore')
outage

,OBS,YEAR,MONTH,U.S._STATE,...,AREAPCT_UC,PCT_LAND,PCT_WATER_TOT,PCT_WATER_INLAND
0,NaN,NaN,NaN,NaN,...,%,%,%,%
1,1.0,2011.0,7.0,Minnesota,...,0.6,91.59,8.41,5.48
2,2.0,2014.0,5.0,Minnesota,...,0.6,91.59,8.41,5.48
...,...,...,...,...,...,...,...,...,...
1532,1532.0,2009.0,8.0,South Dakota,...,0.15,98.31,1.69,1.69
1533,1533.0,2009.0,8.0,South Dakota,...,0.15,98.31,1.69,1.69
1534,1534.0,2000.0,NaN,Alaska,...,0.02,85.76,14.24,2.9

In [63]:
summary_stats = outage['OBS'].describe()

In [64]:
summary_stats

count    1534.00
mean      767.50
std       442.97
          ...
50%       767.50
75%      1150.75
max      1534.00
Name: OBS, Length: 8, dtype: float64

In [65]:
outage = outage.drop(columns='OBS', errors='ignore')
outage

,YEAR,MONTH,U.S._STATE,POSTAL.CODE,...,AREAPCT_UC,PCT_LAND,PCT_WATER_TOT,PCT_WATER_INLAND
0,NaN,NaN,NaN,NaN,...,%,%,%,%
1,2011.0,7.0,Minnesota,MN,...,0.6,91.59,8.41,5.48
2,2014.0,5.0,Minnesota,MN,...,0.6,91.59,8.41,5.48
...,...,...,...,...,...,...,...,...,...
1532,2009.0,8.0,South Dakota,SD,...,0.15,98.31,1.69,1.69
1533,2009.0,8.0,South Dakota,SD,...,0.15,98.31,1.69,1.69
1534,2000.0,NaN,Alaska,AK,...,0.02,85.76,14.24,2.9

In [66]:
outage.replace('NaN', None, inplace=True)
outage['starttime_str'] = outage['OUTAGE.START.DATE'].astype(str) + ' ' + outage['OUTAGE.START.TIME'].astype(str)
outage['starttime_str'] = outage['starttime_str'].str.replace('None', '', regex=False)
outage

,YEAR,MONTH,U.S._STATE,POSTAL.CODE,...,PCT_LAND,PCT_WATER_TOT,PCT_WATER_INLAND,starttime_str
0,NaN,NaN,NaN,NaN,...,%,%,%,"Day of the week, Month Day, Year Hour:Minute:S..."
1,2011.0,7.0,Minnesota,MN,...,91.59,8.41,5.48,2011-07-01 00:00:00 17:00:00
2,2014.0,5.0,Minnesota,MN,...,91.59,8.41,5.48,2014-05-11 00:00:00 18:38:00
...,...,...,...,...,...,...,...,...,...
1532,2009.0,8.0,South Dakota,SD,...,98.31,1.69,1.69,2009-08-29 00:00:00 22:54:00
1533,2009.0,8.0,South Dakota,SD,...,98.31,1.69,1.69,2009-08-29 00:00:00 11:00:00
1534,2000.0,NaN,Alaska,AK,...,85.76,14.24,2.9,nan nan

In [67]:
outage['endtime_str'] = outage['OUTAGE.RESTORATION.DATE'].astype(str) + ' ' + outage['OUTAGE.RESTORATION.TIME'].astype(str)
outage['endtime_str'] = outage['endtime_str'].str.replace('None', '', regex=False)
outage

,YEAR,MONTH,U.S._STATE,POSTAL.CODE,...,PCT_WATER_TOT,PCT_WATER_INLAND,starttime_str,endtime_str
0,NaN,NaN,NaN,NaN,...,%,%,"Day of the week, Month Day, Year Hour:Minute:S...","Day of the week, Month Day, Year Hour:Minute:S..."
1,2011.0,7.0,Minnesota,MN,...,8.41,5.48,2011-07-01 00:00:00 17:00:00,2011-07-03 00:00:00 20:00:00
2,2014.0,5.0,Minnesota,MN,...,8.41,5.48,2014-05-11 00:00:00 18:38:00,2014-05-11 00:00:00 18:39:00
...,...,...,...,...,...,...,...,...,...
1532,2009.0,8.0,South Dakota,SD,...,1.69,1.69,2009-08-29 00:00:00 22:54:00,2009-08-29 00:00:00 23:53:00
1533,2009.0,8.0,South Dakota,SD,...,1.69,1.69,2009-08-29 00:00:00 11:00:00,2009-08-29 00:00:00 14:01:00
1534,2000.0,NaN,Alaska,AK,...,14.24,2.9,nan nan,nan nan

In [68]:
outage['starttime_str']

0       Day of the week, Month Day, Year Hour:Minute:S...
1                            2011-07-01 00:00:00 17:00:00
2                            2014-05-11 00:00:00 18:38:00
                              ...
1532                         2009-08-29 00:00:00 22:54:00
1533                         2009-08-29 00:00:00 11:00:00
1534                                              nan nan
Name: starttime_str, Length: 1535, dtype: object

In [69]:
outage['endtime_str']

0       Day of the week, Month Day, Year Hour:Minute:S...
1                            2011-07-03 00:00:00 20:00:00
2                            2014-05-11 00:00:00 18:39:00
                              ...
1532                         2009-08-29 00:00:00 23:53:00
1533                         2009-08-29 00:00:00 14:01:00
1534                                              nan nan
Name: endtime_str, Length: 1535, dtype: object

In [70]:
outage = outage.drop(columns=['OUTAGE.START.DATE', 'OUTAGE.START.TIME', 'OUTAGE.RESTORATION.DATE', 'OUTAGE.RESTORATION.TIME'], errors='ignore')
outage

,YEAR,MONTH,U.S._STATE,POSTAL.CODE,...,PCT_WATER_TOT,PCT_WATER_INLAND,starttime_str,endtime_str
0,NaN,NaN,NaN,NaN,...,%,%,"Day of the week, Month Day, Year Hour:Minute:S...","Day of the week, Month Day, Year Hour:Minute:S..."
1,2011.0,7.0,Minnesota,MN,...,8.41,5.48,2011-07-01 00:00:00 17:00:00,2011-07-03 00:00:00 20:00:00
2,2014.0,5.0,Minnesota,MN,...,8.41,5.48,2014-05-11 00:00:00 18:38:00,2014-05-11 00:00:00 18:39:00
...,...,...,...,...,...,...,...,...,...
1532,2009.0,8.0,South Dakota,SD,...,1.69,1.69,2009-08-29 00:00:00 22:54:00,2009-08-29 00:00:00 23:53:00
1533,2009.0,8.0,South Dakota,SD,...,1.69,1.69,2009-08-29 00:00:00 11:00:00,2009-08-29 00:00:00 14:01:00
1534,2000.0,NaN,Alaska,AK,...,14.24,2.9,nan nan,nan nan

In [71]:
outage.columns

Index(['YEAR', 'MONTH', 'U.S._STATE', 'POSTAL.CODE', 'NERC.REGION',
       'CLIMATE.REGION', 'ANOMALY.LEVEL', 'CLIMATE.CATEGORY', 'CAUSE.CATEGORY',
       'CAUSE.CATEGORY.DETAIL', 'HURRICANE.NAMES', 'OUTAGE.DURATION',
       'DEMAND.LOSS.MW', 'CUSTOMERS.AFFECTED', 'RES.PRICE', 'COM.PRICE',
       'IND.PRICE', 'TOTAL.PRICE', 'RES.SALES', 'COM.SALES', 'IND.SALES',
       'TOTAL.SALES', 'RES.PERCEN', 'COM.PERCEN', 'IND.PERCEN',
       'RES.CUSTOMERS', 'COM.CUSTOMERS', 'IND.CUSTOMERS', 'TOTAL.CUSTOMERS',
       'RES.CUST.PCT', 'COM.CUST.PCT', 'IND.CUST.PCT', 'PC.REALGSP.STATE',
       'PC.REALGSP.USA', 'PC.REALGSP.REL', 'PC.REALGSP.CHANGE', 'UTIL.REALGSP',
       'TOTAL.REALGSP', 'UTIL.CONTRI', 'PI.UTIL.OFUSA', 'POPULATION',
       'POPPCT_URBAN', 'POPPCT_UC', 'POPDEN_URBAN', 'POPDEN_UC',
       'POPDEN_RURAL', 'AREAPCT_URBAN', 'AREAPCT_UC', 'PCT_LAND',
       'PCT_WATER_TOT', 'PCT_WATER_INLAND', 'starttime_str', 'endtime_str'],
      dtype='object')